---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Space.LightingCalculationWorkplane
source: html/0fdcaa14-7805-883b-292a-73fda280107f.htm
---
# Autodesk.Revit.DB.Mechanical.Space.LightingCalculationWorkplane Property

Get or set the Lighting Calculation Workplane of the Space.

## Syntax (C#)
```csharp
public double LightingCalculationWorkplane { get; set; }
```

## Remarks
This property is used to get or set the Lighting Calculation Workplane (Unit: feet) of the Space.